# number = 23
# running = True
#
# while running:
#     guess = int(input('Введите целое число : '))
#
#     if guess == number:
#         print('Поздравляю вы угадали,')
#         running = False # Это останавливае цикл While
#
#     elif guess < number:
#         print('Нет, загаданное чисто немного больше этого.')
#     else:
#         print('Нет, загаданное чисто немного меньше этого.')
# else:
#     print('Цикл while закончен.')
#     # здесь можно выполнить все что нам еще нужно
# print('завершено')
# # Это последнее выражение выполняется всегда после выполнения оператора if

print(9**19-int(float(9**19)))